dvucinozd/JC-ESP32P4-M3-DEV-Voice-Assistant-V2/main/mp3_player.c
#include <stdio.h>
#include "sdkconfig.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "driver/gpio.h"
#include "driver/ledc.h"
#include "esp_err.h"
#include "esp_log.h"
#include "esp_check.h"
#include "esp_spiffs.h"
#include "esp_vfs_fat.h"
#include "sdmmc_cmd.h"
#include "driver/sdspi_host.h"
#include "driver/spi_common.h"
#include "nvs_flash.h"
#include "bsp/esp-bsp.h"
#include "bsp/display.h"
#include "bsp_board_extra.h"
#include "audio_player.h"

#include "file_iterator.h"
#include "iot_button.h"
#include "button_gpio.h"
#include "wifi_manager.h"
#include "network_manager.h"
#include "bsp/esp32_p4_function_ev_board.h"  // For bsp_sdcard_mount/unmount
#include "local_music_player.h"
#include "ha_client.h"
#include "tts_player.h"
#include "audio_capture.h"
#include "wwd.h"
#include "mqtt_ha.h"
#include "config.h"

#define TAG             "mp3_player"
#define MUSIC_DIR       "/sdcard/music"
#define BUTTON_IO_NUM   35
#define BUTTON_ACTIVE_LEVEL   0

file_iterator_instance_t *_file_iterator;
static audio_player_cb_t audio_idle_callback = NULL;
static QueueHandle_t event_queue;
static SemaphoreHandle_t semph_event;
int music_cnt = 0;
int cnt = 0;

static void audio_player_callback(audio_player_cb_ctx_t *ctx)
{
    ESP_LOGI(TAG,"audio_player_callback %d",ctx->audio_event);
    if(ctx->audio_event == AUDIO_PLAYER_CALLBACK_EVENT_SHUTDOWN || ctx->audio_event == AUDIO_PLAYER_CALLBACK_EVENT_IDLE)
        xSemaphoreGive(semph_event);
        // xQueueSend(event_queue, &(ctx->audio_event), 0);
}

static void mp3_player_task(void *arg)
{
    audio_player_callback_event_t event;
    while(true)
    {
        bsp_extra_player_play_index(_file_iterator,cnt);
        cnt++;
        if(cnt > music_cnt)
            cnt = 0;
        xSemaphoreTake(semph_event, portMAX_DELAY);
    }

    bsp_extra_player_del();
    vTaskDelete(NULL);
}

static void conversation_response_handler(const char *response_text, const char *conversation_id)
{
    ESP_LOGI(TAG, "HA Response [%s]: %s",
             conversation_id ? conversation_id : "none",
             response_text);
}

static void network_event_callback(network_type_t type, bool connected)
{
    if (connected) {
        char ip_str[16];
        network_manager_get_ip(ip_str);

        ESP_LOGI(TAG, "========================================");
        ESP_LOGI(TAG, "Network Connected!");
        ESP_LOGI(TAG, "Type: %s", network_manager_type_to_string(type));
        ESP_LOGI(TAG, "IP Address: %s", ip_str);
        ESP_LOGI(TAG, "========================================");

        // Update MQTT sensor if MQTT is active
        if (mqtt_ha_is_connected()) {
            mqtt_ha_update_sensor("network_type", network_manager_type_to_string(type));
            mqtt_ha_update_sensor("ip_address", ip_str);
        }

        // Mount/unmount SD card based on network type
        if (type == NETWORK_TYPE_ETHERNET) {
            ESP_LOGI(TAG, "📀 Ethernet active - mounting SD card for local music...");
            esp_err_t sd_ret = bsp_sdcard_mount();
            if (sd_ret == ESP_OK) {
                ESP_LOGI(TAG, "✅ SD card mounted successfully - local music playback enabled");

                // Initialize local music player
                esp_err_t music_ret = local_music_player_init();
                if (music_ret == ESP_OK) {
                    ESP_LOGI(TAG, "🎵 Local music player initialized - %d tracks found",
                             local_music_player_get_total_tracks());
                    if (mqtt_ha_is_connected()) {
                        mqtt_ha_update_sensor("sd_card_status", "ready");
                    }
                } else {
                    ESP_LOGW(TAG, "⚠️  Music player init failed - no music files found?");
                    if (mqtt_ha_is_connected()) {
                        mqtt_ha_update_sensor("sd_card_status", "no_music");
                    }
                }
            } else {
                ESP_LOGW(TAG, "⚠️  SD card mount failed - local music unavailable");
                if (mqtt_ha_is_connected()) {
                    mqtt_ha_update_sensor("sd_card_status", "failed");
                }
            }
        } else if (type == NETWORK_TYPE_WIFI) {
            ESP_LOGI(TAG, "📶 WiFi fallback active - SD card disabled");

            // Deinitialize music player if running
            if (local_music_player_is_initialized()) {
                ESP_LOGI(TAG, "Stopping local music player...");
                local_music_player_deinit();
            }

            // Unmount SD card if it was mounted
            if (bsp_sdcard != NULL) {
                ESP_LOGI(TAG, "Unmounting SD card (WiFi fallback mode)...");
                bsp_sdcard_unmount();
                if (mqtt_ha_is_connected()) {
                    mqtt_ha_update_sensor("sd_card_status", "unmounted");
                }
            }
        }
    } else {
        ESP_LOGW(TAG, "Network disconnected: %s", network_manager_type_to_string(type));

        // Deinitialize music player on network disconnect
        if (local_music_player_is_initialized()) {
            ESP_LOGI(TAG, "Stopping local music player...");
            local_music_player_deinit();
        }

        // Unmount SD card on network disconnect
        if (bsp_sdcard != NULL) {
            ESP_LOGI(TAG, "Unmounting SD card (network disconnected)...");
            bsp_sdcard_unmount();
            if (mqtt_ha_is_connected()) {
                mqtt_ha_update_sensor("sd_card_status", "disconnected");
            }
        }
    }
}

static void tts_audio_handler(const uint8_t *audio_data, size_t length)
{
    ESP_LOGI(TAG, "Received TTS audio: %d bytes", length);

    // Feed audio to TTS player
    esp_err_t ret = tts_player_feed(audio_data, length);
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "Failed to feed TTS audio: %s", esp_err_to_name(ret));
    }
}

// Audio streaming test variables
static char *pipeline_handler = NULL;
static int audio_chunks_sent = 0;
static bool pipeline_active = false;
static int warmup_chunks_skip = 0;  // Skip first N chunks after wake word

// Dynamic configuration variables (adjustable via MQTT)
static uint32_t vad_threshold = 180;           // Speech energy threshold (50-300)
static uint32_t vad_silence_duration = 1800;   // Silence duration in ms (1000-3000)
static uint32_t vad_min_speech = 200;          // Min speech duration in ms (100-500)
static uint32_t vad_max_recording = 7000;      // Max recording duration in ms (5000-10000)
static float wwd_threshold = 0.5f;             // Wake word detection threshold (0.3-0.9)

// Forward declarations
static void test_audio_streaming(void);
static void wwd_audio_feed_wrapper(const int16_t *audio_data, size_t samples);
static void on_wake_word_detected(wwd_event_t event, void *user_data);

// MQTT entity callback handlers
static void mqtt_wwd_switch_callback(const char *entity_id, const char *payload)
{
    ESP_LOGI(TAG, "MQTT: WWD switch = %s", payload);

    if (strcmp(payload, "ON") == 0) {
        wwd_start();
        audio_capture_start_wake_word_mode(wwd_audio_feed_wrapper);
        mqtt_ha_update_switch("wwd_enabled", true);
        ESP_LOGI(TAG, "Wake Word Detection enabled via MQTT");
    } else {
        wwd_stop();
        audio_capture_stop();
        mqtt_ha_update_switch("wwd_enabled", false);
        ESP_LOGI(TAG, "Wake Word Detection disabled via MQTT");
    }
}

static void mqtt_restart_callback(const char *entity_id, const char *payload)
{
    ESP_LOGI(TAG, "MQTT: Restart button pressed!");
    ESP_LOGI(TAG, "Restarting in 2 seconds...");
    vTaskDelay(pdMS_TO_TICKS(2000));
    esp_restart();
}

static void mqtt_test_tts_callback(const char *entity_id, const char *payload)
{
    ESP_LOGI(TAG, "MQTT: Test TTS button pressed!");

    if (ha_client_is_connected()) {
        ESP_LOGI(TAG, "Requesting test TTS audio...");
        // Use a valid intent/question that HA will understand
        esp_err_t ret = ha_client_request_tts("Koliko je sati?");
        if (ret == ESP_OK) {
            ESP_LOGI(TAG, "Test TTS request sent successfully");
        } else {
            ESP_LOGE(TAG, "Failed to send test TTS request");
        }
    } else {
        ESP_LOGW(TAG, "Cannot test TTS - not connected to Home Assistant");
    }
}

static void mqtt_vad_threshold_callback(const char *entity_id, const char *payload)
{
    float value = atof(payload);
    vad_threshold = (uint32_t)value;
    ESP_LOGI(TAG, "MQTT: VAD threshold updated to %lu", vad_threshold);
    mqtt_ha_update_number("vad_threshold", (float)vad_threshold);
}

static void mqtt_vad_silence_callback(const char *entity_id, const char *payload)
{
    float value = atof(payload);
    vad_silence_duration = (uint32_t)value;
    ESP_LOGI(TAG, "MQTT: VAD silence duration updated to %lums", vad_silence_duration);
    mqtt_ha_update_number("vad_silence_duration", (float)vad_silence_duration);
}

