dvucinozd/JC-ESP32P4-M3-DEV-Voice-Assistant-V2/main/mp3_player.c
            // WWD will be resumed AFTER TTS playback completes (via callback)
            ESP_LOGI(TAG, "Waiting for TTS playback to complete before resuming WWD...");
            break;
    }
}

static void audio_capture_handler(const uint8_t *audio_data, size_t length)
{
    // Check if pipeline is still active
    if (!pipeline_active || pipeline_handler == NULL) {
        return;  // Pipeline closed or not started
    }

    // Validate audio data
    if (audio_data == NULL || length == 0) {
        return;
    }

    // Skip warmup chunks to avoid wake word remnants
    if (warmup_chunks_skip > 0) {
        warmup_chunks_skip--;
        ESP_LOGD(TAG, "Skipping warmup chunk (%d remaining)", warmup_chunks_skip);
        return;
    }

    // Stream audio to HA
    esp_err_t ret = ha_client_stream_audio(audio_data, length, pipeline_handler);
    if (ret == ESP_OK) {
        audio_chunks_sent++;
    } else {
        ESP_LOGW(TAG, "Failed to stream audio chunk - pipeline may be closed");
    }
}

static void test_audio_streaming(void)
{
    ESP_LOGI(TAG, "========================================");
    ESP_LOGI(TAG, "Starting Audio Streaming Test with VAD");
    ESP_LOGI(TAG, "========================================");

    // Configure VAD with dynamic settings (adjustable via MQTT)
    vad_config_t vad_config = {
        .sample_rate = 16000,
        .speech_threshold = vad_threshold,
        .silence_duration_ms = vad_silence_duration,
        .min_speech_duration_ms = vad_min_speech,
        .max_recording_ms = vad_max_recording
    };

    ESP_LOGI(TAG, "📊 VAD Config: threshold=%lu, silence=%lums, min_speech=%lums, max=%lums",
             vad_config.speech_threshold,
             vad_config.silence_duration_ms,
             vad_config.min_speech_duration_ms,
             vad_config.max_recording_ms);

    // Enable VAD with event callback
    esp_err_t ret = audio_capture_enable_vad(&vad_config, vad_event_handler);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to enable VAD");
        return;
    }

    // Start Assist Pipeline
    pipeline_handler = ha_client_start_conversation();
    if (pipeline_handler == NULL) {
        ESP_LOGE(TAG, "Failed to start pipeline");
        return;
    }

    ESP_LOGI(TAG, "Pipeline started: %s", pipeline_handler);
    ESP_LOGI(TAG, "🎙️  Start speaking now! (VAD will auto-stop after silence)");

    // Reset counters and mark pipeline as active
    audio_chunks_sent = 0;
    pipeline_active = true;
    warmup_chunks_skip = 10;  // Skip first 10 chunks (~640ms) to clear wake word remnants

    // Reset VAD state
    audio_capture_reset_vad();

    // Start capturing and streaming audio
    ret = audio_capture_start(audio_capture_handler);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to start audio capture");
        free(pipeline_handler);
        pipeline_handler = NULL;
    }
}

void app_main(void)
{
    ESP_LOGI(TAG, "===== ESP32-P4 Voice Assistant Starting =====");

    // Initialize NVS (required for WiFi)
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);
    ESP_LOGI(TAG, "NVS initialized");

    // Initialize audio codec
    ESP_LOGI(TAG, "Initializing ES8311 audio codec...");
    ESP_ERROR_CHECK(bsp_extra_codec_init());
    bsp_extra_codec_volume_set(40,NULL);
    bsp_extra_player_init();
    ESP_LOGI(TAG, "ES8311 codec initialized successfully");

    // Initialize TTS player
    ESP_LOGI(TAG, "Initializing TTS player...");
    ret = tts_player_init();
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "TTS player initialization failed");
    } else {
        ESP_LOGI(TAG, "TTS player initialized successfully");
    }

    // Initialize audio capture
    ESP_LOGI(TAG, "Initializing audio capture...");
    ret = audio_capture_init();
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "Audio capture initialization failed");
    } else {
        ESP_LOGI(TAG, "Audio capture initialized successfully");
    }

    // Note: SD card not mounted - using WakeNet models from flash instead
    // The ESP32-P4 Function EV Board's SD card slot uses SDIO pins that are
    // already occupied by the ESP32-C6 WiFi module. WakeNet9 models are loaded
    // directly from the esp-sr managed component directory in flash memory.
    ESP_LOGI(TAG, "WakeNet models will be loaded from flash (managed_components)");

    // Initialize Wake Word Detection
    ESP_LOGI(TAG, "Initializing Wake Word Detection...");
    wwd_config_t wwd_config = wwd_get_default_config();
    wwd_config.callback = on_wake_word_detected;
    wwd_config.user_data = NULL;
    wwd_config.detection_threshold = wwd_threshold;  // Dynamic threshold (adjustable via MQTT)
    ESP_LOGI(TAG, "WWD threshold: %.2f, VAD threshold: %lu", wwd_threshold, vad_threshold);
    esp_err_t wwd_ret = wwd_init(&wwd_config);

    if (wwd_ret != ESP_OK) {
        ESP_LOGE(TAG, "Wake Word Detection initialization failed!");
        ESP_LOGW(TAG, "Falling back to VAD-based activation");
    } else {
        ESP_LOGI(TAG, "Wake Word Detection initialized successfully!");
    }

    // Initialize Network Manager (Ethernet priority + WiFi fallback)
    ESP_LOGI(TAG, "Initializing Network Manager...");
    network_manager_register_callback(network_event_callback);
    ret = network_manager_init();
    if(ret == ESP_OK && network_manager_is_connected()) {
        ESP_LOGI(TAG, "Network connected successfully!");
        ESP_LOGI(TAG, "Active network: %s", network_manager_type_to_string(network_manager_get_active_type()));

        // Initialize Home Assistant client
        ESP_LOGI(TAG, "Connecting to Home Assistant...");
        ret = ha_client_init();
        if(ret == ESP_OK) {
            ESP_LOGI(TAG, "Home Assistant connected successfully!");

            // Register callbacks
            ha_client_register_conversation_callback(conversation_response_handler);
            ha_client_register_tts_audio_callback(tts_audio_handler);
            tts_player_register_complete_callback(tts_playback_complete_handler);

            // Initialize MQTT Home Assistant Discovery
            ESP_LOGI(TAG, "Initializing MQTT Home Assistant Discovery...");
            mqtt_ha_config_t mqtt_config = {
                .broker_uri = MQTT_BROKER_URI,
                .username = MQTT_USERNAME,
                .password = MQTT_PASSWORD,
                .client_id = MQTT_CLIENT_ID
            };

            ret = mqtt_ha_init(&mqtt_config);
            if (ret == ESP_OK) {
                ESP_LOGI(TAG, "MQTT client initialized");

                // Start MQTT client
                ret = mqtt_ha_start();
                if (ret == ESP_OK) {
                    ESP_LOGI(TAG, "MQTT client started");

                    // Wait for MQTT connection
                    vTaskDelay(pdMS_TO_TICKS(2000));

                    // Register entities with Home Assistant
                    ESP_LOGI(TAG, "Registering Home Assistant entities...");

                    // Sensors
                    mqtt_ha_register_sensor("network_type", "Network Type", NULL, NULL);
                    mqtt_ha_register_sensor("ip_address", "IP Address", NULL, NULL);
                    mqtt_ha_register_sensor("sd_card_status", "SD Card Status", NULL, NULL);
                    mqtt_ha_register_sensor("wifi_rssi", "WiFi Signal", "dBm", "signal_strength");
                    mqtt_ha_register_sensor("free_memory", "Free Memory", "KB", NULL);
                    mqtt_ha_register_sensor("uptime", "Uptime", "s", "duration");

                    // Switches
                    mqtt_ha_register_switch("wwd_enabled", "Wake Word Detection", mqtt_wwd_switch_callback);

                    // Buttons
                    mqtt_ha_register_button("restart", "Restart Device", mqtt_restart_callback);
                    mqtt_ha_register_button("test_tts", "Test TTS", mqtt_test_tts_callback);

