dvucinozd/JC-ESP32P4-M3-DEV-Voice-Assistant-V2/main/mp3_player.c
                    // Number controls for VAD tuning
                    mqtt_ha_register_number("vad_threshold", "VAD Speech Threshold",
                                           50, 300, 10, NULL, mqtt_vad_threshold_callback);
                    mqtt_ha_register_number("vad_silence_duration", "VAD Silence Duration",
                                           1000, 3000, 100, "ms", mqtt_vad_silence_callback);
                    mqtt_ha_register_number("vad_min_speech", "VAD Min Speech Duration",
                                           100, 500, 50, "ms", mqtt_vad_min_speech_callback);
                    mqtt_ha_register_number("vad_max_recording", "VAD Max Recording Duration",
                                           5000, 10000, 500, "ms", mqtt_vad_max_recording_callback);

                    // Number control for WWD tuning
                    mqtt_ha_register_number("wwd_threshold", "WWD Detection Threshold",
                                           0.3, 0.9, 0.05, NULL, mqtt_wwd_threshold_callback);

                    ESP_LOGI(TAG, "Home Assistant entities registered (3 sensors, 1 switch, 2 buttons, 5 numbers)");

                    // Start MQTT status update task
                    xTaskCreate(mqtt_status_update_task, "mqtt_status", 4096, NULL, 3, NULL);
                    ESP_LOGI(TAG, "MQTT status update task started");
                } else {
                    ESP_LOGW(TAG, "Failed to start MQTT client");
                }
            } else {
                ESP_LOGW(TAG, "Failed to initialize MQTT client");
            }

            // Start wake word detection if initialized successfully
            if (wwd_ret == ESP_OK && wwd_is_running() == false) {
                ESP_LOGI(TAG, "========================================");
                ESP_LOGI(TAG, "🎙️  Voice Assistant Ready!");
                ESP_LOGI(TAG, "Wake Word Detection enabled");
                ESP_LOGI(TAG, "Say the wake word to activate!");
                ESP_LOGI(TAG, "Wake word: 'Hi ESP' (or your chosen model)");
                ESP_LOGI(TAG, "========================================");

                // Start wake word detection
                wwd_start();
                audio_capture_start_wake_word_mode(wwd_audio_feed_wrapper);
            } else {
                // Fallback to VAD-based activation
                ESP_LOGI(TAG, "========================================");
                ESP_LOGI(TAG, "🎙️  Voice Assistant Ready!");
                ESP_LOGI(TAG, "Using VAD-based activation");
                ESP_LOGI(TAG, "System will start recording in 5 seconds...");
                ESP_LOGI(TAG, "Just start speaking - VAD will detect automatically!");
                ESP_LOGI(TAG, "========================================");
                vTaskDelay(pdMS_TO_TICKS(5000));
                test_audio_streaming();
            }
        } else {
            ESP_LOGW(TAG, "Home Assistant connection failed");
        }
    } else {
        ESP_LOGW(TAG, "WiFi connection failed, continuing without network");
    }

    // SD card MP3 playback disabled - focusing on Voice Assistant functionality
    // TODO: Fix file_iterator crash issue before re-enabling
    ESP_LOGI(TAG, "MP3 playback disabled (Voice Assistant mode)");
    ESP_LOGI(TAG, "Audio codec is ready for Voice Assistant development");
    ESP_LOGI(TAG, "System idle - ready to process voice commands...");

    // Keep the system running for HA communication
    while(1) {
        vTaskDelay(pdMS_TO_TICKS(1000));
    }

}
